def get_tasks_list():
    return [
        {
            "id": 1,
            "topic": "Алгебра",
            "description": "Подставить значение x.",
            "task": r"Найдите значение выражения $5x^2 - 3x + 7$ при $x = 2$.",
            "solution": r"Подставляем $x=2$: $5(4) - 3(2) + 7 = 20 - 6 + 7 = 21$.",
            "level": 1,
            "time_minutes": 10
        },
        {
            "id": 2,
            "topic": "Геометрия",
            "description": "Свойства треугольников.",
            "task": r"Докажите, что сумма углов треугольника равна $180^\circ$.",
            "solution": r"Через параллельную прямую проводят доказательство: сумма внутренних углов равна сумме углов прямой линии.",
            "level": 2,
            "time_minutes": 15
        },
        {
            "id": 3,
            "topic": "Геометрия",
            "description": "Свойства треугольников.",
            "task": r"Докажите, что сумма углов треугольника равна $180^\circ$.",
            "solution": r"Через параллельную прямую проводят доказательство: сумма внутренних углов равна сумме углов прямой линии.",
            "level": 3,
            "time_minutes": 20
        },
        {
            "id": 4,
            "topic": "Геометрия",
            "description": "Свойства треугольников.",
            "task": r"Докажите, что сумма углов треугольника равна $180^\circ$.",
            "solution": r"Через параллельную прямую проводят доказательство: сумма внутренних углов равна сумме углов прямой линии.",
            "level": 1,
            "time_minutes": 10
        },
        {
            "id": 5,
            "topic": "Геометрия",
            "description": "Свойства треугольников.",
            "task": r"Докажите, что сумма углов треугольника равна $180^\circ$.",
            "solution": r"Через параллельную прямую проводят доказательство: сумма внутренних углов равна сумме углов прямой линии.",
            "level": 2,
            "time_minutes": 15
        },
    ]
